name: "VGG_ILSVRC_16_layers_lowrank"
layer {
  name: "data"
  type: "Data"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
  }
 data_param {
    source: "/gs/hs0/tga-crest-deep/yokotaG/caffe/examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
  top: "data"
  top: "label"
}
layer {
  name: "data"
  type: "Data"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
  }
  data_param {
    source: "/gs/hs0/tga-crest-deep/yokotaG/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 1
    backend: LMDB
  }
  top: "data"
  top: "label"
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2a"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv1_2b"
  type: "Convolution"
  bottom: "conv1_2a"
  top: "conv1_2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv1_2c"
  type: "Convolution"
  bottom: "conv1_2b"
  top: "conv1_2c"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2c"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1a"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv2_1b"
  type: "Convolution"
  bottom: "conv2_1a"
  top: "conv2_1b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv2_1c"
  type: "Convolution"
  bottom: "conv2_1b"
  top: "conv2_1c"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1c"
  top: "conv2_1"
}
layer {
  name: "conv2_2a"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv2_2b"
  type: "Convolution"
  bottom: "conv2_2a"
  top: "conv2_2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv2_2c"
  type: "Convolution"
  bottom: "conv2_2b"
  top: "conv2_2c"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2c"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1a"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3_1b"
  type: "Convolution"
  bottom: "conv3_1a"
  top: "conv3_1b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3_1c"
  type: "Convolution"
  bottom: "conv3_1b"
  top: "conv3_1c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1c"
  top: "conv3_1"
}
layer {
  name: "conv3_2a"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3_2b"
  type: "Convolution"
  bottom: "conv3_2a"
  top: "conv3_2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3_2c"
  type: "Convolution"
  bottom: "conv3_2b"
  top: "conv3_2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2c"
  top: "conv3_2"
}
layer {
  name: "conv3_3a"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3_3b"
  type: "Convolution"
  bottom: "conv3_3a"
  top: "conv3_3b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3_3c"
  type: "Convolution"
  bottom: "conv3_3b"
  top: "conv3_3c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3c"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1a"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4_1b"
  type: "Convolution"
  bottom: "conv4_1a"
  top: "conv4_1b"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4_1c"
  type: "Convolution"
  bottom: "conv4_1b"
  top: "conv4_1c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1c"
  top: "conv4_1"
}
layer {
  name: "conv4_2a"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2a"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4_2b"
  type: "Convolution"
  bottom: "conv4_2a"
  top: "conv4_2b"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4_2c"
  type: "Convolution"
  bottom: "conv4_2b"
  top: "conv4_2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2c"
  top: "conv4_2"
}
layer {
  name: "conv4_3a"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3a"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4_3b"
  type: "Convolution"
  bottom: "conv4_3a"
  top: "conv4_3b"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4_3c"
  type: "Convolution"
  bottom: "conv4_3b"
  top: "conv4_3c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3c"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1a"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1a"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5_1b"
  type: "Convolution"
  bottom: "conv5_1a"
  top: "conv5_1b"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5_1c"
  type: "Convolution"
  bottom: "conv5_1b"
  top: "conv5_1c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1c"
  top: "conv5_1"
}
layer {
  name: "conv5_2a"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2a"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5_2b"
  type: "Convolution"
  bottom: "conv5_2a"
  top: "conv5_2b"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5_2c"
  type: "Convolution"
  bottom: "conv5_2b"
  top: "conv5_2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2c"
  top: "conv5_2"
}
layer {
  name: "conv5_3a"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3a"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5_3b"
  type: "Convolution"
  bottom: "conv5_3a"
  top: "conv5_3b"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5_3c"
  type: "Convolution"
  bottom: "conv5_3b"
  top: "conv5_3c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3c"
  top: "conv5_3"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5_3"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  inner_product_param {
    num_output: 4096
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  inner_product_param {
    num_output: 4096
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  inner_product_param {
    num_output: 1000
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss/loss"
}
layer {
  name: "accuracy/top1"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy@1"
  include: { phase: TEST }
  accuracy_param {
    top_k: 1
  }
}
layer {
  name: "accuracy/top5"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy@5"
  include: { phase: TEST }
  accuracy_param {
    top_k: 5
  }
}
