name: "VGG_ILSVRC_16_layers_lowrank"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/opt/storage/data/ilsvrc12/ilsvrc12_train_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/opt/storage/data/ilsvrc12/ilsvrc12_val_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3"
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "conv1_2a"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 11
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv1_2b"
  type: "Convolution"
  bottom: "conv1_2a"
  top: "conv1_2b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 18
    pad: 1
    kernel_size: 3
    group: 1
  }
}
layer {
  name: "conv1_2c"
  type: "Convolution"
  bottom: "conv1_2b"
  top: "conv1_2c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu1_2c"
  type: "ReLU"
  bottom: "conv1_2c"
  top: "conv1_2c"
}
layer {
  name: "pool1_sep"
  type: "Pooling"
  bottom: "conv1_2c"
  top: "pool1_sep"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1a"
  type: "Convolution"
  bottom: "pool1_sep"
  top: "conv2_1a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 10
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv2_1b"
  type: "Convolution"
  bottom: "conv2_1a"
  top: "conv2_1b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    group: 1
  }
}
layer {
  name: "conv2_1c"
  type: "Convolution"
  bottom: "conv2_1b"
  top: "conv2_1c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu2_1c"
  type: "ReLU"
  bottom: "conv2_1c"
  top: "conv2_1c"
}
layer {
  name: "conv2_2a"
  type: "Convolution"
  bottom: "conv2_1c"
  top: "conv2_2a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 28
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv2_2b"
  type: "Convolution"
  bottom: "conv2_2a"
  top: "conv2_2b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 28
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layer {
  name: "conv2_2c"
  type: "Convolution"
  bottom: "conv2_2b"
  top: "conv2_2c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu2_2c"
  type: "ReLU"
  bottom: "conv2_2c"
  top: "conv2_2c"
}
layer {
  name: "pool2_sep"
  type: "Pooling"
  bottom: "conv2_2c"
  top: "pool2_sep"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1a"
  type: "Convolution"
  bottom: "pool2_sep"
  top: "conv3_1a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 36
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv3_1b"
  type: "Convolution"
  bottom: "conv3_1a"
  top: "conv3_1b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv3_1c"
  type: "Convolution"
  bottom: "conv3_1b"
  top: "conv3_1c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu3_1c"
  type: "ReLU"
  bottom: "conv3_1c"
  top: "conv3_1c"
}
layer {
  name: "conv3_2a"
  type: "Convolution"
  bottom: "conv3_1c"
  top: "conv3_2a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 60
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv3_2b"
  type: "Convolution"
  bottom: "conv3_2a"
  top: "conv3_2b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv3_2c"
  type: "Convolution"
  bottom: "conv3_2b"
  top: "conv3_2c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu3_2c"
  type: "ReLU"
  bottom: "conv3_2c"
  top: "conv3_2c"
}
layer {
  name: "conv3_3a"
  type: "Convolution"
  bottom: "conv3_2c"
  top: "conv3_3a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv3_3b"
  type: "Convolution"
  bottom: "conv3_3a"
  top: "conv3_3b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 56
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv3_3c"
  type: "Convolution"
  bottom: "conv3_3b"
  top: "conv3_3c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu3_3c"
  type: "ReLU"
  bottom: "conv3_3c"
  top: "conv3_3c"
}
layer {
  name: "pool3_sep"
  type: "Pooling"
  bottom: "conv3_3c"
  top: "pool3_sep"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1a"
  type: "Convolution"
  bottom: "pool3_sep"
  top: "conv4_1a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv4_1b"
  type: "Convolution"
  bottom: "conv4_1a"
  top: "conv4_1b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 100
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv4_1c"
  type: "Convolution"
  bottom: "conv4_1b"
  top: "conv4_1c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu4_1c"
  type: "ReLU"
  bottom: "conv4_1c"
  top: "conv4_1c"
}
layer {
  name: "conv4_2a"
  type: "Convolution"
  bottom: "conv4_1c"
  top: "conv4_2a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 116
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv4_2b"
  type: "Convolution"
  bottom: "conv4_2a"
  top: "conv4_2b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 100
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv4_2c"
  type: "Convolution"
  bottom: "conv4_2b"
  top: "conv4_2c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu4_2c"
  type: "ReLU"
  bottom: "conv4_2c"
  top: "conv4_2c"
}
layer {
  name: "conv4_3a"
  type: "Convolution"
  bottom: "conv4_2c"
  top: "conv4_3a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 132
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv4_3b"
  type: "Convolution"
  bottom: "conv4_3a"
  top: "conv4_3b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 132
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv4_3c"
  type: "Convolution"
  bottom: "conv4_3b"
  top: "conv4_3c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu4_3c"
  type: "ReLU"
  bottom: "conv4_3c"
  top: "conv4_3c"
}
layer {
  name: "pool4_sep"
  type: "Pooling"
  bottom: "conv4_3c"
  top: "pool4_sep"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1a"
  type: "Convolution"
  bottom: "pool4_sep"
  top: "conv5_1a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv5_1b"
  type: "Convolution"
  bottom: "conv5_1a"
  top: "conv5_1b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv5_1c"
  type: "Convolution"
  bottom: "conv5_1b"
  top: "conv5_1c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu5_1c"
  type: "ReLU"
  bottom: "conv5_1c"
  top: "conv5_1c"
}
layer {
  name: "conv5_2a"
  type: "Convolution"
  bottom: "conv5_1c"
  top: "conv5_2a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv5_2b"
  type: "Convolution"
  bottom: "conv5_2a"
  top: "conv5_2b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv5_2c"
  type: "Convolution"
  bottom: "conv5_2b"
  top: "conv5_2c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu5_2c"
  type: "ReLU"
  bottom: "conv5_2c"
  top: "conv5_2c"
}
layer {
  name: "conv5_3a"
  type: "Convolution"
  bottom: "conv5_2c"
  top: "conv5_3a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv5_3b"
  type: "Convolution"
  bottom: "conv5_3a"
  top: "conv5_3b"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    group: 4
  }
}
layer {
  name: "conv5_3c"
  type: "Convolution"
  bottom: "conv5_3b"
  top: "conv5_3c"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "relu5_3c"
  type: "ReLU"
  bottom: "conv5_3c"
  top: "conv5_3c"
}
layer {
  name: "l2_cost"
  type: "EuclideanLoss"
  bottom: "conv5_3"
  bottom: "conv5_3c"
  top: "l2"
}
